
## Plan Result (shareable-lists-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/27307)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ShareableListsApi-Prod:299" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ShareableListsApi-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/shareablelistsapi-prod-app:c6a7b955bcc4767cc5a5398b885d380489574a76" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/shareablelistsapi-prod-app:a24bb7eda91a60527c2c5c5f6c0ae69e1f57e860"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  ~ secrets                = [
                        # (1 unchanged element hidden)
                        {
                            name      = "DATABASE_URL"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:database_url::"
                        },
                      + {
                          + name      = "DATABASE_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:host::"
                        },
                      + {
                          + name      = "DATABASE_USER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:username::"
                        },
                      + {
                          + name      = "DATABASE_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:password::"
                        },
                      + {
                          + name      = "DATABASE_NAME"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:dbname::"
                        },
                      + {
                          + name      = "DATABASE_PORT"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:port::"
                        },
                    ]
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ShareableListsApi-Prod" -> (known after apply)
      ~ revision                 = 299 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (9 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"2066dfaf-5d65-456d-9ab7-5c899a309dc5","JobName":"shareable-lists-api_infrastructure_plan_prod","PRNumber":108,"Program":"tfcmt","SHA1":"a24bb7eda91a60527c2c5c5f6c0ae69e1f57e860","Target":"shareable-lists-api-cdk","Vars":{}} -->